app/controllers/users_controller.rb

  def show # show specified user
    @user = User.find(params[:id]) # define a valiable user to find id of user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(user_params) #create an user with params defined in user_params method
    if @user.save # if user is save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)